---

C#Visual BasicVisual C++

Revit 2024 API
---
XYZ..::..IsWithinLengthLimits Method
XYZ Class See Also Send Feedback
---

Validates that the input point is within Revit design limits.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public static bool IsWithinLengthLimits(
    	XYZ point
    )

Visual Basic
---

    Public Shared Function IsWithinLengthLimits ( _
    	point As XYZ _
    ) As Boolean

Visual C++
---

    public:
    static bool IsWithinLengthLimits(
    	XYZ^ point
    )

#### Parameters

point
    Type: Autodesk.Revit.DB..::..XYZThe point to test.

#### Return Value

True if the input point is within Revit design limits, false otherwise.

# Remarks

Used to validate input for geometry construction methods.

# See Also

XYZ Class

Autodesk.Revit.DB Namespace